Tekla.Structures.DirectManipulation.Adapter.IAppInfo
The Tekla.Structures.DirectManipulation.Adapter.IAppInfo interfaces the application information retrieval.

Tekla.Structures.DirectManipulation.Adapter.IAppInfo.GetDataFolder
Gets data folder.
Returns: The data folder.

Tekla.Structures.DirectManipulation.Adapter.IAppInfo.IsViewerMode
Determines whether the current application is in Viewer mode.
Returns: A value indicating whether the current application is in Viewer mode.